Revit 2024 API
IFCAnyHandle.SetAttribute Method (String, IList<Boolean>)
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void SetAttribute(
	string name,
	IList<bool> values
)
Visual Basic
Public Sub SetAttribute ( _
	name As String, _
	values As IList(Of Boolean) _
)
Visual C++
public:
void SetAttribute(
	String^ name,
	IList<bool>^ values
)
Parameters
name
Type: System.String
values
Type: System.Collections.Generic.IList<Boolean>
See Also
IFCAnyHandle Class
SetAttribute Overload
Autodesk.Revit.DB.IFC Namespace